sad1886/MK_ZRU/cmsis/_MDR32Fx.h
/**
  ******************************************************************************
  * @file    MDR32Fx.h
  * @author  Phyton Application Team
  * @version V1.0.0
  * @date    22/06/2011
  * @brief   This file contains all the Special Function Registers definitions
  *          for the Milandr MDR32Fx microcontroller.
  ******************************************************************************
  * <br><br>
  *
  * THE PRESENT FIRMWARE WHICH IS FOR GUIDANCE ONLY AIMS AT PROVIDING CUSTOMERS
  * WITH CODING INFORMATION REGARDING THEIR PRODUCTS IN ORDER FOR THEM TO SAVE
  * TIME. AS A RESULT, PHYTON SHALL NOT BE HELD LIABLE FOR ANY DIRECT, INDIRECT
  * OR CONSEQUENTIAL DAMAGES WITH RESPECT TO ANY CLAIMS ARISING
  * FROM THE CONTENT OF SUCH FIRMWARE AND/OR THE USE MADE BY CUSTOMERS OF THE
  * CODING INFORMATION CONTAINED HEREIN IN CONNECTION WITH THEIR PRODUCTS.
  *
  * <h2><center>&copy; COPYRIGHT 2010 Phyton</center></h2>
  ******************************************************************************
  * FILE MDR32Fx.h
  */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __MDR32FX_H
#define __MDR32FX_H

/** @addtogroup __CMSIS CMSIS
  * @{
  */

/** @defgroup __MDR32Fx MDR32F9Qx Peripheral
  * @{
  */

#ifdef __cplusplus
extern "C" {
#endif

#if defined ( __CC_ARM   )
  #pragma anon_unions
#endif

/* MDR32Fx Interrupt Number Definition */
typedef enum IRQn
{
/*-- Cortex-M3 Processor Exceptions Numbers ----------------------------------*/
  NonMaskableInt_IRQn     = -14,  /*!<  2 Non Maskable Interrupt              */
  HardFault_IRQn          = -13,  /*!<  3 Hard Fault Interrupt                */
  MemoryManagement_IRQn   = -12,  /*!<  4 Memory Management Interrupt         */
  BusFault_IRQn           = -11,  /*!<  5 Bus Fault Interrupt                 */
  UsageFault_IRQn         = -10,  /*!<  6 Usage Fault Interrupt               */
  SVCall_IRQn             = -5,   /*!< 11 SV Call Interrupt                   */
  PendSV_IRQn             = -2,   /*!< 14 Pend SV Interrupt                   */
  SysTick_IRQn            = -1,   /*!< 15 System Tick Timer Interrupt         */

/*-- MDR32Fx specific Interrupt Numbers --------------------------------------*/
  CAN1_IRQn               =  0,   /*!< CAN1 Interrupt                         */
  CAN2_IRQn               =  1,   /*!< CAN1 Interrupt                         */
  USB_IRQn                =  2,   /*!< USB Host Interrupt                     */
  DMA_IRQn                =  5,   /*!< DMA Interrupt                          */
  UART1_IRQn              =  6,   /*!< UART1 Interrupt                        */
  UART2_IRQn              =  7,   /*!< UART2 Interrupt                        */
  SSP1_IRQn               =  8,   /*!< SSP1 Interrupt                         */
  I2C_IRQn                =  10,  /*!< I2C Interrupt                          */
  POWER_IRQn              =  11,  /*!< POWER Detecor Interrupt                */
  WWDG_IRQn               =  12,  /*!< Window Watchdog Interrupt              */
  Timer1_IRQn             =  14,  /*!< Timer1 Interrupt                       */
  Timer2_IRQn             =  15,  /*!< Timer2 Interrupt                       */
  Timer3_IRQn             =  16,  /*!< Timer3 Interrupt                       */
  ADC_IRQn                =  17,  /*!< ADC Interrupt                          */
  COMPARATOR_IRQn         =  19,  /*!< COMPARATOR Interrupt                   */
  SSP2_IRQn               =  20,  /*!< SSP2 Interrupt                         */
  BACKUP_IRQn             =  27,  /*!< BACKUP Interrupt                       */
  EXT_INT1_IRQn           =  28,  /*!< EXT_INT1 Interrupt                     */
  EXT_INT2_IRQn           =  29,  /*!< EXT_INT2 Interrupt                     */
  EXT_INT3_IRQn           =  30,  /*!< EXT_INT3 Interrupt                     */
  EXT_INT4_IRQn           =  31   /*!< EXT_INT4 Interrupt                     */
}IRQn_Type;

/** @addtogroup __Configuration_of_CMSIS Configuration of CMSIS
  * @{
  */

/* Configuration of the Cortex-M3 Processor and Core Peripherals */
#define __CM3_REV              0x0102   /*!< Cortex-M3 Core Revision                      */
#define __MPU_PRESENT             1     /*!< MPU present or not                           */
#define __NVIC_PRIO_BITS          3     /*!< Number of Bits used for Priority Levels      */
#define __Vendor_SysTickConfig    0     /*!< Set to 1 if different SysTick Config is used */

/** @} */ /* End of group __Configuration_of_CMSIS */

/* Includes ------------------------------------------------------------------*/
#include "core_cm3.h"
#include "system_MDR32F9Qx.h"

/** @defgroup __Exported_types Exported types
  * @{
  */

typedef enum {RESET = 0, SET = !RESET} FlagStatus, ITStatus;

typedef enum {DISABLE = 0, ENABLE = !DISABLE} FunctionalState;
#define IS_FUNCTIONAL_STATE(STATE) (((STATE) == DISABLE) || ((STATE) == ENABLE))

typedef enum {ERROR = 0, SUCCESS = !ERROR} ErrorStatus;

/** @} */ /* End of group __Exported_types */

/** @addtogroup __MDR32Fx_Peripheral_Units MDR32F9Qx Peripheral Units
  * @{
  */

/** @defgroup MDR32Fx_Periph_CAN CAN
  * @{
  */

/** @defgroup MDR32Fx_Periph_CAN_Data_Structures Data Structures
  * @{
  */

/* MDR_CAN_BUF_TypeDef structure */
typedef struct
{
  __IO uint32_t ID;
  __IO uint32_t DLC;
  __IO uint32_t DATAL;
  __IO uint32_t DATAH;
}MDR_CAN_BUF_TypeDef;

/* MDR_CAN_BUF_FILTER_TypeDef structure */
typedef struct
{
  __IO uint32_t MASK;
  __IO uint32_t FILTER;
}MDR_CAN_BUF_FILTER_TypeDef;

/* MDR_CAN_TypeDef structure */
typedef struct
{
  __IO uint32_t CONTROL;
  __IO uint32_t STATUS;
  __IO uint32_t BITTMNG;
       uint32_t RESERVED0;
  __IO uint32_t INT_EN;
       uint32_t RESERVED1[2];
  __IO uint32_t OVER;
  __IO uint32_t RXID;
  __IO uint32_t RXDLC;
  __IO uint32_t RXDATAL;
  __IO uint32_t RXDATAH;
  __IO uint32_t TXID;
  __IO uint32_t TXDLC;
  __IO uint32_t DATAL;
  __IO uint32_t DATAH;
  __IO uint32_t BUF_CON[32];
  __IO uint32_t INT_RX;
  __IO uint32_t RX;
  __IO uint32_t INT_TX;
  __IO uint32_t TX;
       uint32_t RESERVED2[76];
    MDR_CAN_BUF_TypeDef CAN_BUF[32];
       uint32_t RESERVED3[64];
    MDR_CAN_BUF_FILTER_TypeDef CAN_BUF_FILTER[32];
}MDR_CAN_TypeDef;

/** @} */ /* End of group MDR32Fx_Periph_CAN_Data_Structures */

